Revit 2026 API

# ElementCreatedPhaseId Property

---

Id of a Phase at which the Element was created.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId CreatedPhaseId { get; set; }
```
```vb
Public Property CreatedPhaseId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ CreatedPhaseId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member CreatedPhaseId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The element does not allow setting the property CreatedPhaseId to the value of createdPhaseId. -or- When setting this property: Invalid order of phases: An object cannot be demolished before it was created. |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | When setting this property: The element does not have properties CreatedPhaseId and DemolishedPhaseId. -or- When setting this property: The element does not allow setting the properties CreatedPhaseId and DemolishedPhaseId. |

After setting the property CreatedPhaseId, regeneration can fail if CreatedPhaseId and DemolishedPhaseId are out of order with respect to their index in the property Document.Phases.

When Revit is running with UI activated, the default created phase for newly created elements is inherited from the phase of the currently active view.

When Revit is running without its UI, such as when Revit runs on Autodesk Forge Design Automation API for Revit, the default CreatedPhaseId for newly created elements is the latest phase in Autodesk::Revit::DB::Document::Phases.

#### Reference

Element Class

Autodesk.Revit.DB Namespace